ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/R5SS_ECC_AGG_CORE0_53000000h.xml
	<bitfield id="CPU0_IDATA_BANK0_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_idata_bank0_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGG_CORE0_DED_EOI_REG" acronym="ECC_AGG_CORE0_DED_EOI_REG" offset="316" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="Write of 1 to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host. The bit is self clearing and will be read as a zero." range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGG_CORE0_DED_STATUS_REG0" acronym="ECC_AGG_CORE0_DED_STATUS_REG0" offset="320" width="32" description="Interrupt Status Register 0">
		<bitfield id="CPU0_KS_VIM_RAMECC_PEND" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Pending Status for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="R/W1TS"/>
	<bitfield id="B1TCM0_BANK1_PEND" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank1_pend" range="26" rwaccess="R/W1TS"/>
	<bitfield id="B1TCM0_BANK0_PEND" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank0_pend" range="25" rwaccess="R/W1TS"/>
	<bitfield id="B0TCM0_BANK1_PEND" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank1_pend" range="24" rwaccess="R/W1TS"/>
	<bitfield id="B0TCM0_BANK0_PEND" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank0_pend" range="23" rwaccess="R/W1TS"/>
	<bitfield id="ATCM0_BANK1_PEND" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Pending Status for atcm0_bank1_pend" range="22" rwaccess="R/W1TS"/>
	<bitfield id="ATCM0_BANK0_PEND" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Pending Status for atcm0_bank0_pend" range="21" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM7_PEND" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram7_pend" range="20" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM6_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram6_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM5_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram5_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM4_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram4_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM3_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram3_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM2_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram2_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM1_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram1_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM0_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram0_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDIRTY_RAM_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for cpu0_ddirty_ram_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM3_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram3_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM2_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram2_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM1_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram1_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM0_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram0_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK3_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank3_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK2_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank2_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK1_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank1_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK0_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank0_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGG_CORE0_DED_ENABLE_SET_REG0" acronym="ECC_AGG_CORE0_DED_ENABLE_SET_REG0" offset="384" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="CPU0_KS_VIM_RAMECC_ENABLE_SET" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="R/W1TS"/>
	<bitfield id="B1TCM0_BANK1_ENABLE_SET" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank1_pend" range="26" rwaccess="R/W1TS"/>
	<bitfield id="B1TCM0_BANK0_ENABLE_SET" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank0_pend" range="25" rwaccess="R/W1TS"/>
	<bitfield id="B0TCM0_BANK1_ENABLE_SET" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank1_pend" range="24" rwaccess="R/W1TS"/>
	<bitfield id="B0TCM0_BANK0_ENABLE_SET" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank0_pend" range="23" rwaccess="R/W1TS"/>
	<bitfield id="ATCM0_BANK1_ENABLE_SET" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank1_pend" range="22" rwaccess="R/W1TS"/>
	<bitfield id="ATCM0_BANK0_ENABLE_SET" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank0_pend" range="21" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM7_ENABLE_SET" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram7_pend" range="20" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM6_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram6_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM5_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram5_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM4_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram4_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM3_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram3_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM2_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram2_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM1_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram1_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDATA_RAM0_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram0_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DDIRTY_RAM_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddirty_ram_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM3_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram3_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM2_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram2_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM1_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram1_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_DTAG_RAM0_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram0_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK3_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank3_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK2_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank2_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK1_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank1_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_IDATA_BANK0_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank0_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="CPU0_ITAG_RAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGG_CORE0_DED_ENABLE_CLR_REG0" acronym="ECC_AGG_CORE0_DED_ENABLE_CLR_REG0" offset="448" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="CPU0_KS_VIM_RAMECC_ENABLE_CLR" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="R/W1TC"/>
	<bitfield id="B1TCM0_BANK1_ENABLE_CLR" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Clear Register for b1tcm0_bank1_pend" range="26" rwaccess="R/W1TC"/>
	<bitfield id="B1TCM0_BANK0_ENABLE_CLR" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Clear Register for b1tcm0_bank0_pend" range="25" rwaccess="R/W1TC"/>
	<bitfield id="B0TCM0_BANK1_ENABLE_CLR" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Clear Register for b0tcm0_bank1_pend" range="24" rwaccess="R/W1TC"/>
	<bitfield id="B0TCM0_BANK0_ENABLE_CLR" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Clear Register for b0tcm0_bank0_pend" range="23" rwaccess="R/W1TC"/>
	<bitfield id="ATCM0_BANK1_ENABLE_CLR" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Clear Register for atcm0_bank1_pend" range="22" rwaccess="R/W1TC"/>
	<bitfield id="ATCM0_BANK0_ENABLE_CLR" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Clear Register for atcm0_bank0_pend" range="21" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM7_ENABLE_CLR" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram7_pend" range="20" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM6_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram6_pend" range="19" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM5_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram5_pend" range="18" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM4_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram4_pend" range="17" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM3_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram3_pend" range="16" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM2_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram2_pend" range="15" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM1_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram1_pend" range="14" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDATA_RAM0_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddata_ram0_pend" range="13" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DDIRTY_RAM_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_ddirty_ram_pend" range="12" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DTAG_RAM3_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_dtag_ram3_pend" range="11" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DTAG_RAM2_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_dtag_ram2_pend" range="10" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DTAG_RAM1_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_dtag_ram1_pend" range="9" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_DTAG_RAM0_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_dtag_ram0_pend" range="8" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_IDATA_BANK3_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_idata_bank3_pend" range="7" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_IDATA_BANK2_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_idata_bank2_pend" range="6" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_IDATA_BANK1_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_idata_bank1_pend" range="5" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_IDATA_BANK0_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_idata_bank0_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="CPU0_ITAG_RAM0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for cpu0_itag_ram0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGG_CORE0_AGGR_ENABLE_SET" acronym="ECC_AGG_CORE0_AGGR_ENABLE_SET" offset="512" width="32" description="AGGR interrupt enable set Register.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register><register id="ECC_AGG_CORE0_AGGR_ENABLE_CLR" acronym="ECC_AGG_CORE0_AGGR_ENABLE_CLR" offset="516" width="32" description="AGGR interrupt enable clear Register.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register><register id="ECC_AGG_CORE0_AGGR_STATUS_SET" acronym="ECC_AGG_CORE0_AGGR_STATUS_SET" offset="520" width="32" description="AGGR interrupt status set Register.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="2-bit saturating counter of the number of timeout errors that have occurred since last cleared. 2'b00 - No timeout errors have occurred 2'b01 - 1 timeout erro has occurred 2'b10 - 2 timeout error has occurred 2'b11 - 3 or more timeout errors have occurred A write of a non-zero value to this register increments that many from the timeout fields.  If the value written is less than the current value of the counter, then the pending level interrupt stays asserted. . If this register goes from 0 ot non zero a level interrupt will be asserted as well as a pulse interrupt. If the value was non zero to non zero then the level interrupt would remain asserted, but no new pulse interrupt would be asserted. You must write the eoi register to get a new pulse interrupt." range="3:2" rwaccess="R/WI"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="2-bit saturating counter of the number of parity errors that have occurred since last cleared. 2'b00 - No parity errors have occurred 2'b01 - 1 parity error has occurred 2'b10 - 2 parity error has occurred 2'b11 - 3 or more parity error have occurred A write of a non-zero value to this register incrments that many from the parity fields.  If the value written is less than the current value of the counter, then the pending level interrupt stays asserted. If this register goes from 0 ot non zero a level interrupt will be asserted as well as a pulse interrupt. If the value was non zero to non zero then the level interrupt would remain asserted, but no new pulse interrupt would be asserted. You must write the eoi register to get a new pulse interrupt." range="1:0" rwaccess="R/WI"/>
	</register><register id="ECC_AGG_CORE0_AGGR_STATUS_CLR" acronym="ECC_AGG_CORE0_AGGR_STATUS_CLR" offset="524" width="32" description="AGGR interrupt status clear Register.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="2'b00 - No timeout errors have occurred 2'b01 - 1 timeout erro has occurred 2'b10 - 2 timeout error has occurred 2'b11 - 3 or more timeout errors have occurred A write of a non-zero value to this register decrements that many from the timeout fields.  If the resulting written value is non zero, then the pending level interrupt stays asserted. A new pulse interrupt will nto be asserted, you must write the eoi register for that to occur. If you write a value more than the counter value the result will be zero." range="3:2" rwaccess="R/WD"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="2'b00 - No parity errors have occurred 2'b01 - 1 parity error has occurred 2'b10 - 2 parity error has occurred 2'b11 - 3 or more parity error have occurred A write of a non-zero value to this register decrements that many from the parity fields.  If the resulting written value is non zero, then the pending level interrupt stays asserted. A new pulse interrupt will nto be asserted, you must write the eoi register for that to occur. If you write a value more than the counter value the result will be zero." range="1:0" rwaccess="R/WD"/>
	</register>
</module>